Revit 2027 API
Rebar.GetRebarConstraintsManager Method
 Returns an object for managing the external constraints on the Rebar element
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public RebarConstraintsManager GetRebarConstraintsManager()
Public Function GetRebarConstraintsManager As RebarConstraintsManager
public:
RebarConstraintsManager^ GetRebarConstraintsManager()
member GetRebarConstraintsManager : unit -> RebarConstraintsManager
Return Value
RebarConstraintsManager
Exceptions
Exception | Condition
InvalidOperationException |  The Rebar element does not have external constraints that can be edited.
See Also
Reference
Rebar Class
Autodesk.Revit.DB.Structure Namespace